interface Prop {
    color?: string;
}

const HeartLips = ({ color }: Prop) => (
    <svg
        id="Calque_1"
        data-name="Calque 1"
        xmlns="http://www.w3.org/2000/svg"
        xmlnsXlink="http://www.w3.org/1999/xlink"
        viewBox="0 0 909.82 1192.73"
    >
        <defs>
            <radialGradient
                id="Dégradé_sans_nom_274"
                data-name="Dégradé sans nom 274"
                cx="456.11"
                cy="784.49"
                fx="456.11"
                fy="784.49"
                r="52.76"
                gradientTransform="translate(0 273.56) scale(1 .66)"
                gradientUnits="userSpaceOnUse"
            >
                <stop offset="0" stopColor={color} />
                <stop offset=".29" stopColor={color} stop-opacity=".99" />
                <stop offset=".44" stopColor={color} stop-opacity=".95" />
                <stop offset=".55" stopColor={color} stop-opacity=".89" />
                <stop offset=".65" stopColor={color} stop-opacity=".8" />
                <stop offset=".73" stopColor={color} stop-opacity=".69" />
                <stop offset=".81" stopColor={color} stop-opacity=".55" />
                <stop offset=".88" stopColor={color} stop-opacity=".38" />
                <stop offset=".94" stopColor={color} stop-opacity=".2" />
                <stop offset="1" stopColor={color} stop-opacity="0" />
            </radialGradient>
            <radialGradient
                id="Dégradé_sans_nom_263"
                data-name="Dégradé sans nom 263"
                cx="455.49"
                cy="827.58"
                fx="455.49"
                fy="827.58"
                r="50.09"
                gradientTransform="translate(32.32 138.1) scale(.93 .84)"
                gradientUnits="userSpaceOnUse"
            >
                <stop offset="0" stopColor={color} />
                <stop offset=".29" stopColor={color} stop-opacity=".99" />
                <stop offset=".44" stopColor={color} stop-opacity=".95" />
                <stop offset=".55" stopColor={color} stop-opacity=".89" />
                <stop offset=".65" stopColor={color} stop-opacity=".8" />
                <stop offset=".73" stopColor={color} stop-opacity=".69" />
                <stop offset=".81" stopColor={color} stop-opacity=".55" />
                <stop offset=".88" stopColor={color} stop-opacity=".38" />
                <stop offset=".94" stopColor={color} stop-opacity=".2" />
                <stop offset="1" stopColor={color} stop-opacity="0" />
            </radialGradient>
        </defs>
        <path
            d="M486.03,783.49c-11.64-3.37-20.42-9.32-26.41-6.32-1.06-.08-4.71-.82-5.81-.82-1.02,0-4.94-.06-5.92,0-6-2.99-17.33,1.34-27.08,8.5-6.77,4.97-16.45,15.31-12.86,20.76,3.59,5.46,13.63,7.1,28.06,2.93,2.74-.79,5.27-1.72,7.56-2.73,3.36,1.05,7.42,1.67,11.8,1.67s8.56-.64,11.95-1.72c2.32,1.03,4.89,1.98,7.67,2.78,14.42,4.17,25.57,5.5,29.15.04,3.59-5.46-3.68-20.91-18.1-25.09Z"
            style={{ fill: 'url(#Dégradé_sans_nom_274)', opacity: 0.7 }}
        />
        <path
            d="M500.93,819.34c-3.75-7.74-6.1-8.33-32.02-4.09-.68.11-1.27.52-1.9.8-3.29-.72-6.87-1.12-10.62-1.12-3.98,0-7.78.45-11.24,1.25-1.36-.7-2.7-1.61-4.28-1.94-15.27-3.15-28.28-3.65-32.02,4.09-3.75,7.74,4.52,18.45,18.46,23.93,4.66,1.83,9.36,2.84,13.69,3.09,4.47,1.55,9.74,2.45,15.39,2.45,4.24,0,8.27-.51,11.91-1.42,4.47-.2,9.34-1.22,14.17-3.12,13.94-5.48,22.21-16.19,18.46-23.93Z"
            style={{ fill: 'url(#Dégradé_sans_nom_263)', opacity: 0.7 }}
        />
        <g>
            <path d="M473.48,801.09c.42,1.86-1.43,2.43-2.18,3.54-.35.52-.9.48,0,1.09,1.51,1.01,7.03,2.51,9.03,2.96,7.57,1.7,16.19,1.45,23.8-.11,4.78-.98,14.67-6.37,18.71-3.69,1.35.89,2.23,2.72,1.49,4.24-2.18,4.49-17.66,3.51-22.22,3.97-13.59,1.35-25.6,4.09-39.78,4.38-19.57.41-34.65-2.51-53.45-4.38-5.37-.53-16.98.49-21.18-2.81-2.07-1.62-1.58-4.06.45-5.4,4.04-2.68,13.93,2.71,18.71,3.69,7.61,1.56,16.23,1.81,23.8.11,2.01-.45,7.52-1.95,9.03-2.96.91-.61.36-.56,0-1.09-.75-1.11-2.59-1.69-2.18-3.54,11.59,5.31,24.37,5.31,35.97,0ZM475.66,812c-1.63-.04-3.22-.41-4.73-1-1.74-.68-4.41-3.17-4.92-3.29-.95-.24-4.4,1.32-5.95,1.5-2.08.25-5.48.24-7.6.08-2.24-.17-6.01-1.69-7.09-1.64-.56.03-3.74,2.73-5.32,3.35s-3.19.74-4.74,1.26c10.74,1.39,21.63.62,32.46.84l7.88-1.11Z" />
            <path d="M409,820.87c12.69,17.9,34.47,30.21,56.87,25.21,10.32-2.3,21.8-9.11,29.15-16.64,1.42-1.45,6.9-9.14,8.16-9.06l1.38.59c2.43,2.8-4.71,12.22-6.81,14.48-14.44,15.51-37.51,21-57.86,15.87-11.52-2.9-27.29-13.28-32.47-24.23-1.26-2.66-3.32-7.72,1.58-6.22Z" />
            <path d="M504.01,801.09c-1.48,1.55-11.65-10.6-13.36-11.98-16.76-13.51-53.15-13.55-69.99-.24-3.55,2.81-6.17,6.8-9.3,9.79-1.16,1.11-2.7,2.54-4.38,2.43-.69-6,5.7-13.2,10.07-16.91,13.62-11.56,26.23-11.06,43.06-10.91,13.04.11,22.58,1.78,32.96,10.15,4.67,3.77,11.61,11.36,10.95,17.67Z" />
            <path
                d="M475.66,812l-7.88,1.11c-10.83-.23-21.72.54-32.46-.84,1.55-.52,3.19-.66,4.74-1.26s4.76-3.32,5.32-3.35c1.08-.05,4.85,1.47,7.09,1.64,2.11.16,5.51.16,7.6-.08,1.55-.18,5-1.74,5.95-1.5.51.13,3.17,2.62,4.92,3.29,1.51.59,3.1.96,4.73,1Z"
                style={{ fill: '#fff' }}
            />
        </g>
    </svg>
);

export default HeartLips;
